Repository: LeanVibe/Septica
Catalog: Resources/Localizations/*.lproj/Achievements.strings
Languages: ro

# category_card_mastery
source: Card Mastery
ro: Măiestria Cărților

# category_game_wins
source: Victory Achievements
ro: Realizări de Victorie

# category_strategic_play
source: Strategic Excellence
ro: Excelență Strategică

# category_perfect_games
source: Perfect Games
ro: Jocuri Perfecte

# category_folklore_learning
source: Romanian Folklore
ro: Folclorul Românesc

# category_traditional_music
source: Traditional Music
ro: Muzica Tradițională

# category_regional_history
source: Regional History
ro: Istoria Regională

# category_cultural_pride
source: Cultural Pride
ro: Mândria Culturală

# category_mathematical_thinking
source: Mathematical Mind
ro: Gândirea Matematică

# category_critical_thinking
source: Critical Thinking
ro: Gândirea Critică

# category_pattern_recognition
source: Pattern Master
ro: Maestrul Tiparelor

# category_problem_solving
source: Problem Solver
ro: Rezolvitor de Probleme

# category_friendly_play
source: Friendly Play
ro: Joc Prietenos

# category_mentorship
source: Mentorship
ro: Mentoratul

# category_community_participation
source: Community Spirit
ro: Spiritul Comunității

# category_cultural_sharing
source: Cultural Ambassador
ro: Ambasador Cultural

# difficulty_bronze
source: Bronze
ro: Bronz

# difficulty_silver
source: Silver
ro: Argint

# difficulty_gold
source: Gold
ro: Aur

# difficulty_legendary
source: Legendary
ro: Legendar

# region_transylvania
source: Transylvania
ro: Transilvania

# region_wallachia
source: Wallachia
ro: Țara Românească

# region_dobrudja
source: Dobrudja
ro: Dobrogea

# region_banat
source: Banat
ro: Banatul

# requirement_games_played
source: Play %d games
ro: Joacă %d jocuri

# requirement_games_won
source: Win %d games
ro: Câștigă %d jocuri

# requirement_perfect_games
source: Achieve %d perfect games
ro: Realizează %d jocuri perfecte

# requirement_cards_played
source: Play %d cards
ro: Joacă %d cărți

# requirement_specific_card
source: Play specific card %d times
ro: Joacă cartea specifică de %d ori

# requirement_win_streak
source: Win %d games in a row
ro: Câștigă %d jocuri consecutive

# requirement_tournament_participation
source: Participate in %d tournaments
ro: Participă la %d turnee

# requirement_tournament_wins
source: Win %d tournaments
ro: Câștigă %d turnee

# requirement_cultural_quiz_answered
source: Answer %d cultural questions
ro: Răspunde la %d întrebări culturale

# requirement_cultural_quiz_perfect
source: Perfect score on %d cultural quizzes
ro: Scor perfect la %d teste culturale

# requirement_folktale_learned
source: Learn %d Romanian folktales
ro: Învață %d basme românești

# requirement_tradition_explored
source: Explore %d Romanian traditions
ro: Explorează %d tradiții românești

# requirement_community_interaction
source: Interact with community %d times
ro: Interacționează cu comunitatea de %d ori

# requirement_mentorship_provided
source: Mentor %d players
ro: Mentorează %d jucători

# requirement_seasonal_event
source: Participate in %d seasonal events
ro: Participă la %d evenimente sezoniere

# requirement_daily_play_streak
source: Play daily for %d days
ro: Joacă zilnic timp de %d zile

# requirement_strategic_moves
source: Make %d strategic moves correctly
ro: Fă %d mișcări strategice corecte

# requirement_mathematical_puzzle
source: Solve %d mathematical puzzles
ro: Rezolvă %d puzzle-uri matematice

# achievement_first_steps_title
source: First Steps
ro: Primii Pași

# achievement_first_steps_desc
source: Play your first game of Septica
ro: Joacă primul tău joc de Șeptică

# achievement_first_steps_context
source: Every great journey begins with a single step, just like the Romanian proverb says: 'Drumul se face mergând' (The road is made by walking).
ro: Orice călătorie mare începe cu un singur pas, cum spune proverbul românesc: 'Drumul se face mergând'.

# achievement_seven_explorer_title
source: Seven Explorer
ro: Exploratorul Șepticii

# achievement_seven_explorer_desc
source: Play the Seven of Hearts 7 times
ro: Joacă Șeptică de Roșu de 7 ori

# achievement_seven_explorer_context
source: The number seven holds special significance in Romanian culture, appearing in countless fairy tales and folk traditions.
ro: Numărul șapte are o semnificație specială în cultura românească, apărând în nenumărate basme și tradiții populare.

# achievement_quick_learner_title
source: Quick Learner
ro: Învățăcel Isteț

# achievement_quick_learner_desc
source: Win your first 3 games
ro: Câștigă primele tale 3 jocuri

# achievement_quick_learner_context
source: Romanian children have always been praised for their quick learning abilities, carrying on traditions through generations.
ro: Copiii români au fost întotdeauna lăudați pentru abilitățile lor de învățare rapidă, perpetuând tradițiile prin generații.

# achievement_card_virtuoso_title
source: Card Virtuoso
ro: Virtuozul Cărților

# achievement_card_virtuoso_desc
source: Master all four suits by winning 25 games with each
ro: Stăpânește toate cele patru culori câștigând 25 de jocuri cu fiecare

# achievement_card_virtuoso_context
source: Like a skilled 'lăutar' (traditional musician) who masters every instrument, true card mastery comes from understanding all aspects of the game.
ro: Ca un lăutar priceput care stăpânește fiecare instrument, adevărata măiestrie vine din înțelegerea tuturor aspectelor jocului.

# achievement_perfect_harmony_title
source: Perfect Harmony
ro: Armonia Perfectă

# achievement_perfect_harmony_desc
source: Achieve 10 perfect games
ro: Realizează 10 jocuri perfecte

# achievement_perfect_harmony_context
source: In Romanian folk music, perfect harmony creates the most beautiful melodies. In Septica, perfect games show true mastery.
ro: În muzica populară românească, armonia perfectă creează cele mai frumoase melodii. În Șeptică, jocurile perfecte arată adevărata măiestrie.

# achievement_lightning_victory_title
source: Lightning Victory
ro: Victoria Fulger

# achievement_lightning_victory_desc
source: Win a game in under 2 minutes
ro: Câștigă un joc în mai puțin de 2 minute

# achievement_lightning_victory_context
source: As swift as the legendary Romanian hero Făt-Frumos, who could accomplish great deeds with lightning speed.
ro: La fel de iute ca legendarul erou românesc Făt-Frumos, care putea împlini fapte mari cu viteza fulgerului.

# achievement_folklore_scholar_title
source: Folklore Scholar
ro: Cărturarul Folclorului

# achievement_folklore_scholar_desc
source: Learn 15 Romanian folktales
ro: Învață 15 basme românești

# achievement_folklore_scholar_context
source: Romanian folklore is one of Europe's richest traditions, passed down through generations of storytellers.
ro: Folclorul românesc este una dintre cele mai bogate tradiții din Europa, transmise prin generații de poveștitori.

# achievement_transylvania_guardian_title
source: Guardian of Transylvania
ro: Păzitorul Transilvaniei

# achievement_transylvania_guardian_desc
source: Complete all Transylvania-themed challenges
ro: Completează toate provocările cu tema Transilvania

# achievement_transylvania_guardian_context
source: Transylvania, the land beyond the forest, holds countless legends and a proud cultural heritage worth protecting.
ro: Transilvania, țara de dincolo de pădure, păstrează nenumărate legende și o moștenire culturală mândră ce merită apărată.

# achievement_moldovan_wisdom_title
source: Moldovan Wisdom
ro: Înțelepciunea Moldovei

# achievement_moldovan_wisdom_desc
source: Master strategic play patterns from Moldova region
ro: Stăpânește tiparele strategice de joc din regiunea Moldovei

# achievement_moldovan_wisdom_context
source: The strategic thinking of Moldovan people has been honed through centuries of adapting to challenges while preserving their culture.
ro: Gândirea strategică a moldovenilor s-a format prin secole de adaptare la provocări păstrându-și cultura.

# achievement_wallachian_courage_title
source: Wallachian Courage
ro: Curajul Muntenesc

# achievement_wallachian_courage_desc
source: Win 50 challenging games
ro: Câștigă 50 de jocuri provocatoare

# achievement_wallachian_courage_context
source: Wallachia, the land of brave voivodes like Vlad the Impaler, teaches us that courage conquers all obstacles.
ro: Muntenia, țara voievozilor curajoși ca Vlad Țepeș, ne învață că curajul învinge toate obstacolele.

# achievement_young_mathematician_title
source: Young Mathematician
ro: Tânărul Matematician

# achievement_young_mathematician_desc
source: Solve 20 mathematical puzzles related to card combinations
ro: Rezolvă 20 de puzzle-uri matematice legate de combinațiile de cărți

# achievement_young_mathematician_context
source: Romania has produced brilliant mathematicians. Every card combination teaches probability and strategic thinking.
ro: România a dat matematicieni străluciti. Fiecare combinație de cărți învață probabilități și gândire strategică.

# achievement_pattern_master_title
source: Pattern Master
ro: Maestrul Tiparelor

# achievement_pattern_master_desc
source: Recognize and use 15 different strategic patterns
ro: Recunoaște și folosește 15 tipare strategice diferite

# achievement_pattern_master_context
source: Like the intricate patterns in Romanian traditional carpets, recognizing game patterns is an art form.
ro: Ca tiparele încurcate din covorele tradiționale românești, recunoașterea tiparelor din joc este o artă.

# achievement_strategic_thinker_title
source: Strategic Thinker
ro: Gânditorul Strategic

# achievement_strategic_thinker_desc
source: Make optimal moves in 100 challenging situations
ro: Fă mișcări optime în 100 de situații provocatoare

# achievement_strategic_thinker_context
source: Strategic thinking has always been valued in Romanian culture, from ancient Dacian warriors to modern chess grandmasters.
ro: Gândirea strategică a fost întotdeauna prețuită în cultura românească, de la antici războinici daci la marii maeștri șahiști moderni.

# achievement_friendly_neighbor_title
source: Friendly Neighbor
ro: Vecinul Prietenos

# achievement_friendly_neighbor_desc
source: Play 25 friendly games with others
ro: Joacă 25 de jocuri prietenești cu alții

# achievement_friendly_neighbor_context
source: Romanian hospitality is legendary. 'Oaspetele în casă, Dumnezeu în casă' (Guest in the house, God in the house).
ro: Ospitalitatea românească este legendară. 'Oaspetele în casă, Dumnezeu în casă'.

# achievement_cultural_ambassador_title
source: Cultural Ambassador
ro: Ambasadorul Cultural

# achievement_cultural_ambassador_desc
source: Share 10 Romanian cultural facts with others
ro: Împărtășește 10 curiozități culturale românești cu alții

# achievement_cultural_ambassador_context
source: Sharing our beautiful culture helps preserve it for future generations and builds bridges between peoples.
ro: Împărtășirea frumoasei noastre culturi ajută la păstrarea ei pentru generațiile viitoare și construiește punți între popoare.

# achievement_mentor_elder_title
source: Wise Mentor
ro: Mentorul Înțelept

# achievement_mentor_elder_desc
source: Help 5 new players learn the game
ro: Ajută 5 jucători noi să învețe jocul

# achievement_mentor_elder_context
source: In Romanian villages, elders have always passed wisdom to the young. Continue this beautiful tradition.
ro: În satele românești, bătrânii au transmis întotdeauna înțelepciunea tinerilor. Continuă această frumoasă tradiție.

# achievement_winter_festivities_title
source: Winter Festivities
ro: Sărbătorile de Iarnă

# achievement_winter_festivities_desc
source: Participate in all winter holiday events
ro: Participă la toate evenimentele de sărbători de iarnă

# achievement_winter_festivities_context
source: Romanian winter traditions, from colinde (carols) to dramatic customs, celebrate the magic of the season.
ro: Tradițiile româneștii de iarnă, de la colinde la obiceiuri dramatice, sărbătoresc magia sezonului.

# achievement_spring_renewal_title
source: Spring Renewal
ro: Renașterea de Primăvară

# achievement_spring_renewal_desc
source: Complete the Mărțișor seasonal challenge
ro: Completează provocarea sezonieră Mărțișor

# achievement_spring_renewal_context
source: Mărțișor, the beautiful Romanian spring tradition, symbolizes renewal, hope, and the awakening of nature.
ro: Mărțișorul, frumoasa tradiție românească de primăvară, simbolizează reînnoirea, speranța și trezirea naturii.

# achievement_summer_celebration_title
source: Summer Celebration
ro: Sărbătoarea Verii

# achievement_summer_celebration_desc
source: Participate in Iezna (Sânzienele) summer festival
ro: Participă la festivalul de vară Iezna (Sânzienele)

# achievement_summer_celebration_context
source: Sânzienele, the Romanian midsummer celebration, honors nature's abundance and the power of healing herbs.
ro: Sânzienele, sărbătoarea românească de mijloc de vară, onorează abundența naturii și puterea plantelor vindecătoare.

# achievement_autumn_harvest_title
source: Autumn Harvest
ro: Secerișul de Toamnă

# achievement_autumn_harvest_desc
source: Complete harvest season challenges
ro: Completează provocările sezonului secerișului

# achievement_autumn_harvest_context
source: Romanian autumn traditions celebrate the harvest and prepare communities for winter through shared work and celebration.
ro: Tradițiile românești de toamnă sărbătoresc secerișul și pregătesc comunitățile pentru iarnă prin muncă și sărbătoare împărțite.

# achievement_dacian_warrior_title
source: Dacian Warrior
ro: Războinicul Dac

# achievement_dacian_warrior_desc
source: Demonstrate exceptional courage and skill across all game modes
ro: Demonstrează curaj și abilitate excepționale în toate modurile de joc

# achievement_dacian_warrior_context
source: The ancient Dacians, ancestors of Romanians, were known throughout the Roman Empire for their bravery and tactical brilliance.
ro: Anticii daci, strămoșii românilor, erau cunoscuți în tot Imperiul Roman pentru curajul și strălucirea lor tactică.

# achievement_romanian_pride_title
source: Romanian Pride
ro: Mândria Românească

# achievement_romanian_pride_desc
source: Master every aspect of the game while learning our cultural heritage
ro: Stăpânește fiecare aspect al jocului în timp ce înveți moștenirea noastră culturală

# achievement_romanian_pride_context
source: True Romanian pride comes from understanding our rich heritage while excelling in all endeavors. 'Români suntem și români să rămânem!'
ro: Adevărata mândrie românească vine din înțelegerea bogatului nostru patrimoniu și din excelarea în toate întreprinderile. 'Români suntem și români să rămânem!'

# achievement_cultural_treasure_title
source: Cultural Treasure
ro: Comoara Culturală

# achievement_cultural_treasure_desc
source: Unlock all cultural content and share it with the community
ro: Deblochează tot conținutul cultural și împărtășește-l cu comunitatea

# achievement_cultural_treasure_context
source: You have become a guardian of Romanian culture, ensuring these treasures live on for future generations.
ro: Ai devenit un păzitor al culturii românești, asigurându-te că aceste comori trăiesc pentru generațiile viitoare.

# milestone_25_percent
source: Great start! You're on your way to mastering this achievement.
ro: Început grozav! Ești pe drumul către stăpânirea acestei realizări.

# milestone_50_percent
source: Halfway there! Your dedication is showing.
ro: La jumătatea drumului! Dedicarea ta se vede.

# milestone_75_percent
source: Almost complete! The finish line is in sight.
ro: Aproape gata! Linia de sosire e în vedere.

# milestone_100_percent
source: Achievement unlocked! Congratulations on your success!
ro: Realizare deblocată! Felicitări pentru succesul tău!

# encouragement_keep_playing
source: Every game makes you stronger! Keep playing and learning.
ro: Fiecare joc te face mai puternic! Continuă să joci și să înveți.

# encouragement_cultural_learning
source: Learning about Romanian culture makes you wiser! Continue exploring our heritage.
ro: Învățarea despre cultura românească te face mai înțelept! Continuă să explorezi moștenirea noastră.

# encouragement_mathematical_growth
source: Your mathematical thinking is improving! Numbers are everywhere in life.
ro: Gândirea ta matematică se îmbunătățește! Numerele sunt peste tot în viață.

# encouragement_social_connection
source: Playing with others creates lasting friendships! Keep building connections.
ro: Jocul cu alții creează prietenii de durată! Continuă să construiești legături.

# encouragement_strategic_development
source: Your strategic thinking is developing beautifully! Each move teaches patience.
ro: Gândirea ta strategică se dezvoltă frumos! Fiecare mișcare învață răbdarea.

# content_card_back
source: Card Back
ro: Spatele Cărții

# content_game_theme
source: Game Theme
ro: Tema Jocului

# content_folk_story
source: Folk Story
ro: Poveste Populară

# content_music_track
source: Music Track
ro: Piesă Muzicală

# content_cultural_fact
source: Cultural Fact
ro: Curiozitate Culturală

# content_title
source: Title
ro: Titlu

# content_decorator
source: Decorator
ro: Decorațiune

source: Achievement Completed!
ro: Realizare Completată!

# achievement_progress
source: Progress: %d/%d
ro: Progres: %d/%d

# achievement_reward_earned
source: Reward Earned: %@
ro: Recompensă Câștigată: %@

# achievement_experience_gained
source: +%d Experience Points
ro: +%d Puncte de Experiență

# achievement_cultural_knowledge_gained
source: +%d Cultural Knowledge Points
ro: +%d Puncte de Cunoștințe Culturale
